In [1]:
import pandas as pd
import numpy as np

In [2]:
data={"Company":["GOOG","GOOG","MSFT","MSFT","META","META"],
      "Person": ["Asna","Zhulldyz", "Dida", "Ara", "Danik", "Nurla"],
      "Sales":[220,150,130,400,500,250]
}

In [3]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'META', 'META'],
 'Person': ['Asna', 'Zhulldyz', 'Dida', 'Ara', 'Danik', 'Nurla'],
 'Sales': [220, 150, 130, 400, 500, 250]}

In [4]:
df=pd.DataFrame(data)
df

  Company    Person  Sales
0    GOOG      Asna    220
1    GOOG  Zhulldyz    150
2    MSFT      Dida    130
3    MSFT       Ara    400
4    META     Danik    500
5    META     Nurla    250

# GroupBY

In [5]:
by_comp=df.groupby("Company")

In [6]:
by_comp.mean()

         Sales
Company
GOOG     185.0
META     375.0
MSFT     265.0

In [7]:
by_comp.std()

              Sales
Company
GOOG      49.497475
META     176.776695
MSFT     190.918831

In [8]:
by_comp.min()

        Person  Sales
Company
GOOG      Asna    150
META     Danik    250
MSFT       Ara    130

In [9]:
df

  Company    Person  Sales
0    GOOG      Asna    220
1    GOOG  Zhulldyz    150
2    MSFT      Dida    130
3    MSFT       Ara    400
4    META     Danik    500
5    META     Nurla    250

In [10]:
by_comp.count()

         Person  Sales
Company
GOOG          2      2
META          2      2
MSFT          2      2

In [11]:
by_comp.describe().transpose()

Company            GOOG        META        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   185.000000  375.000000  265.000000
      std     49.497475  176.776695  190.918831
      min    150.000000  250.000000  130.000000
      25%    167.500000  312.500000  197.500000
      50%    185.000000  375.000000  265.000000
      75%    202.500000  437.500000  332.500000
      max    220.000000  500.000000  400.000000

In [12]:
by_comp.describe().T

Company            GOOG        META        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   185.000000  375.000000  265.000000
      std     49.497475  176.776695  190.918831
      min    150.000000  250.000000  130.000000
      25%    167.500000  312.500000  197.500000
      50%    185.000000  375.000000  265.000000
      75%    202.500000  437.500000  332.500000
      max    220.000000  500.000000  400.000000

In [13]:
by_comp.describe().T["GOOG"]

Sales  count      2.000000
       mean     185.000000
       std       49.497475
       min      150.000000
       25%      167.500000
       50%      185.000000
       75%      202.500000
       max      220.000000
Name: GOOG, dtype: float64